{
  "books": [
    {
      "id": 1,
      "title": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "genre": "Classic",
      "price": 15.99,
      "image": "The_Great_Gatsby.jpg",
      "description": "The Great Gatsby is a novel by F. Scott Fitzgerald. It tells the story of Jay Gatsby, a self-made millionaire, and his pursuit of Daisy Buchanan, a wealthy young woman."
    },
    {
      "id": 2,
      "title": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "genre": "Classic",
      "price": 12.99,
      "image": "To_Kill_a_Mockingbird.jpg",
      "description": "To Kill a Mockingbird is a novel by Harper Lee. Set in the American South during the 1930s, it explores themes of racial injustice and moral growth through the eyes of a young girl named Scout Finch."
    },
    {
      "id": 3,
      "title": "1984",
      "author": "George Orwell",
      "genre": "Dystopian",
      "price": 14.99,
      "image": "1984.jpg",
      "description": "1984 is a dystopian novel by George Orwell. It portrays a totalitarian society where the government, led by the Party and its leader Big Brother, exercises total control over its citizens."
    },
    {
      "id": 4,
      "title": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "genre": "Fantasy",
      "price": 18.99,
      "image": "The_Hobbit.jpg",
      "description": "The Hobbit is a fantasy novel by J.R.R. Tolkien. It follows the journey of Bilbo Baggins as he accompanies a group of dwarves on a quest to reclaim their homeland from the dragon Smaug."
    },
    {
      "id": 5,
      "title": "Harry Potter and the Sorcerer's Stone",
      "author": "J.K. Rowling",
      "genre": "Fantasy",
      "price": 22.99,
      "image": "Harry_Potter_and_the_Sorcerer's_Stone.jpg",
      "description": "Harry Potter and the Sorcerer's Stone is the first book in the Harry Potter series by J.K. Rowling. It follows the story of a young wizard, Harry Potter, as he discovers his magical heritage."
    },
    {
      "id": 6,
      "title": "Pride and Prejudice",
      "author": "Jane Austen",
      "genre": "Classic",
      "price": 16.99,
      "image": "Pride_and_Prejudice.jpg",
      "description": "Pride and Prejudice is a novel by Jane Austen. It explores the themes of love, class, and manners in early 19th-century England, focusing on the spirited Elizabeth Bennet and the proud Mr. Darcy."
    },
    {
      "id": 7,
      "title": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "genre": "Coming-of-Age",
      "price": 13.99,
      "image": "The_Catcher_in_the_Rye.jpg",
      "description": "The Catcher in the Rye is a novel by J.D. Salinger. It follows the experiences of Holden Caulfield, a teenager navigating the challenges of adolescence and societal expectations in 1950s New York City."
    },
    {
      "id": 8,
      "title": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "genre": "Fantasy",
      "price": 25.99,
      "image": "The_Lord_of_the_Rings.jpg",
      "description": "The Lord of the Rings is a fantasy trilogy by J.R.R. Tolkien, consisting of The Fellowship of the Ring, The Two Towers, and The Return of the King. It follows the quest to destroy the One Ring and defeat the Dark Lord Sauron."
    },
    {
      "id": 9,
      "title": "Brave New World",
      "author": "Aldous Huxley",
      "genre": "Dystopian",
      "price": 17.99,
      "image": "Brave_New_World.jpg",
      "description": "Brave New World is a dystopian novel by Aldous Huxley. It presents a futuristic society where citizens are conditioned for conformity and pleasure, exploring themes of technological control and individualism."
    },
    {
      "id": 10,
      "title": "The Hunger Games",
      "author": "Suzanne Collins",
      "genre": "Dystopian",
      "price": 19.99,
      "image": "The_Hunger_Games.jpg",
      "description": "The Hunger Games is a dystopian novel by Suzanne Collins. It follows the story of Katniss Everdeen, who participates in the Hunger Games—a televised event where children fight to the death in a post-apocalyptic world."
    },
    {
      "id": 11,
      "title": "The Alchemist",
      "author": "Paulo Coelho",
      "genre": "Philosophical Fiction",
      "price": 14.99,
      "image": "The_Alchemist.jpg",
      "description": "The Alchemist is a philosophical fiction novel by Paulo Coelho. It follows Santiago, a young Andalusian shepherd, on a journey to find a hidden treasure in Egypt, discovering the importance of pursuing one's dreams."
    },
    {
      "id": 12,
      "title": "Moby-Dick",
      "author": "Herman Melville",
      "genre": "Adventure",
      "price": 20.99,
      "image": "Moby-Dick.jpg",
      "description": "Moby-Dick is an adventure novel by Herman Melville. It tells the story of Captain Ahab's obsessive quest to kill the white whale Moby Dick, exploring themes of revenge and the consequences of unchecked ambition."
    },
    {
      "id": 13,
      "title": "One Hundred Years of Solitude",
      "author": "Gabriel García Márquez",
      "genre": "Magical Realism",
      "price": 18.99,
      "image": "One_Hundred_Years_of_Solitude.jpg",
      "description": "One Hundred Years of Solitude is a magical realism novel by Gabriel García Márquez. It chronicles the multi-generational Buendía family in the fictional town of Macondo, exploring themes of love, power, and the passage of time."
    },
    {
      "id": 14,
      "title": "The Odyssey",
      "author": "Homer",
      "genre": "Epic Poetry",
      "price": 16.99,
      "image": "The_Odyssey.jpg",
      "description": "The Odyssey is an epic poem attributed to Homer. It recounts the adventures of Odysseus as he tries to return home after the Trojan War, facing mythical creatures and challenges along the way."
    },
    {
      "id": 15,
      "title": "The Girl with the Dragon Tattoo",
      "author": "Stieg Larsson",
      "genre": "Mystery",
      "price": 21.99,
      "image": "The_Girl_with_the_Dragon_Tattoo.jpg",
      "description": "The Girl with the Dragon Tattoo is a mystery novel by Stieg Larsson. It follows investigative journalist Mikael Blomkvist and hacker Lisbeth Salander as they unravel a complex web of corruption and secrets."
    }
  ],
  "users": [
    {
      "id": 1,
      "username": "user1",
      "password": "password1"
    },
    {
      "id": 2,
      "username": "user2",
      "password": "password2"
    },
    {
      "username": "mahesh",
      "password": "mahesh123",
      "id": 3
    }
  ]
}